performance/evaluation-submit.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Async AI Evaluation Submit Benchmark"><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp></TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent submissions">
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,20)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(RAMP_SECONDS,5)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">1</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Ongoing interview records"><stringProp name="filename">${__P(DATA_FILE,evaluation-submit.csv)}</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">token,recordId,questionId,answer</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">false</boolProp><boolProp name="stopThread">true</boolProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON and JWT"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="Authorization" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${token}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST answer and enqueue evaluation"><stringProp name="HTTPSampler.path">${__P(BASE_URL,http://localhost:8080)}/api/records/${recordId}/submit</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;answers&quot;:[{&quot;questionId&quot;:${questionId},&quot;answer&quot;:&quot;${answer}&quot;}]}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp></HTTPSamplerProxy><hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Returns task immediately"><collectionProp name="Asserion.test_strings"><stringProp name="1">&quot;status&quot;:&quot;pending&quot;</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">16</intProp></ResponseAssertion><hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary"><boolProp name="ResultCollector.error_logging">false</boolProp><stringProp name="filename">${__P(RESULT_FILE,evaluation-submit-results.jtl)}</stringProp></ResultCollector><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>